VDowbensky/efr32_baremetal/baremetal_test/chip/efr32fg1v_agc.h
/***************************************************************************//**
 * @file
 * @brief EFR32FG1V_AGC register and bit field definitions
 *******************************************************************************
 * # License
 * <b>Copyright 2020 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 ******************************************************************************/

#if defined(__ICCARM__)
#pragma system_include       /* Treat file as system include file. */
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
#pragma clang system_header  /* Treat file as system include file. */
#endif

/***************************************************************************//**
 * @addtogroup Parts
 * @{
 ******************************************************************************/
/* =========================================================================================================================== */
/* ================                                            AGC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Auto gain controller (AGC)
  */

typedef struct {                                /*!< (@ 0x40087000) AGC Structure                                              */
  __IM  uint32_t  STATUS0;                      /*!< (@ 0x00000000) STATUS0                                                    */
  __IM  uint32_t  STATUS1;                      /*!< (@ 0x00000004) STATUS1                                                    */
  __IM  uint32_t  RSSI;                         /*!< (@ 0x00000008) RSSI                                                       */
  __IM  uint32_t  FRAMERSSI;                    /*!< (@ 0x0000000C) FRAMERSSI                                                  */
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  CTRL0;                        /*!< (@ 0x00000014) CTRL0                                                      */
  __IOM uint32_t  CTRL1;                        /*!< (@ 0x00000018) CTRL1                                                      */
  __IOM uint32_t  CTRL2;                        /*!< (@ 0x0000001C) CTRL2                                                      */
  __IOM uint32_t  RSSISTEPTHR;                  /*!< (@ 0x00000020) RSSISTEPTHR                                                */
  __IOM uint32_t  IFPEAKDET;                    /*!< (@ 0x00000024) IFPEAKDET                                                  */
  __IOM uint32_t  MANGAIN;                      /*!< (@ 0x00000028) MANGAIN                                                    */
  __IM  uint32_t  RESERVED1;
  __IM  uint32_t  IF;                           /*!< (@ 0x00000030) IF                                                         */
  __OM  uint32_t  IFS;                          /*!< (@ 0x00000034) IFS                                                        */
  __OM  uint32_t  IFC;                          /*!< (@ 0x00000038) IFC                                                        */
  __IOM uint32_t  IEN;                          /*!< (@ 0x0000003C) IEN                                                        */
  __OM  uint32_t  CMD;                          /*!< (@ 0x00000040) CMD                                                        */
  __IM  uint32_t  RESERVED2;
  __IOM uint32_t  GAINRANGE;                    /*!< (@ 0x00000048) GAINRANGE                                                  */
  __IOM uint32_t  GAININDEX;                    /*!< (@ 0x0000004C) GAININDEX                                                  */
  __IOM uint32_t  SLICECODE;                    /*!< (@ 0x00000050) SLICECODE                                                  */
  __IOM uint32_t  ATTENCODE1;                   /*!< (@ 0x00000054) ATTENCODE1                                                 */
  __IOM uint32_t  ATTENCODE2;                   /*!< (@ 0x00000058) ATTENCODE2                                                 */
  __IOM uint32_t  ATTENCODE3;                   /*!< (@ 0x0000005C) ATTENCODE3                                                 */
  __IOM uint32_t  GAINERROR1;                   /*!< (@ 0x00000060) GAINERROR1                                                 */
  __IOM uint32_t  GAINERROR2;                   /*!< (@ 0x00000064) GAINERROR2                                                 */
  __IOM uint32_t  GAINERROR3;                   /*!< (@ 0x00000068) GAINERROR3                                                 */
  __IOM uint32_t  MANUALCTRL;                   /*!< (@ 0x0000006C) MANUALCTRL                                                 */
  __IOM uint32_t  GAINSTEPLIM;                  /*!< (@ 0x00000070) GAINSTEPLIM                                                */
  __IOM uint32_t  LOOPDEL;                      /*!< (@ 0x00000074) LOOPDEL                                                    */
  __IOM uint32_t  MININDEX;                     /*!< (@ 0x00000078) MININDEX                                                   */
} AGC_Typedef;                                     /*!< Size = 124 (0x7c)                                                         */

                 /** @} */

/***************************************************************************//**
 * @addtogroup EFR32FG1V_AGC
 * @{
 * @defgroup EFR32FG1V_ADC_BitFields  AGC Bit Fields
 * @{
 ******************************************************************************/

/* =========================================================================================================================== */
/* ================                                            AGC                                            ================ */
/* =========================================================================================================================== */

