VDowbensky/efr32_baremetal/baremetal_test/chip/efr32fg1v_agc.h
/* ========================================================  STATUS0  ======================================================== */
#define AGC_STATUS0_GAININDEX_Pos         (0UL)                     /*!< GAININDEX (Bit 0)                                     */
#define AGC_STATUS0_GAININDEX_Msk         (0x3fUL)                  /*!< GAININDEX (Bitfield-Mask: 0x3f)                       */
#define AGC_STATUS0_CCA_Pos               (10UL)                    /*!< CCA (Bit 10)                                          */
#define AGC_STATUS0_CCA_Msk               (0x400UL)                 /*!< CCA (Bitfield-Mask: 0x01)                             */
#define AGC_STATUS0_GAINOK_Pos            (12UL)                    /*!< GAINOK (Bit 12)                                       */
#define AGC_STATUS0_GAINOK_Msk            (0x1000UL)                /*!< GAINOK (Bitfield-Mask: 0x01)                          */
#define AGC_STATUS0_GAINIFPGA_Pos         (13UL)                    /*!< GAINIFPGA (Bit 13)                                    */
#define AGC_STATUS0_GAINIFPGA_Msk         (0x1e000UL)               /*!< GAINIFPGA (Bitfield-Mask: 0x0f)                       */
#define AGC_STATUS0_GAINLNADEGEN_Pos      (17UL)                    /*!< GAINLNADEGEN (Bit 17)                                 */
#define AGC_STATUS0_GAINLNADEGEN_Msk      (0xe0000UL)               /*!< GAINLNADEGEN (Bitfield-Mask: 0x07)                    */
#define AGC_STATUS0_GAINLNASLICE_Pos      (20UL)                    /*!< GAINLNASLICE (Bit 20)                                 */
#define AGC_STATUS0_GAINLNASLICE_Msk      (0xf00000UL)              /*!< GAINLNASLICE (Bitfield-Mask: 0x0f)                    */
#define AGC_STATUS0_GAINLNAATTEN_Pos      (25UL)                    /*!< GAINLNAATTEN (Bit 25)                                 */
#define AGC_STATUS0_GAINLNAATTEN_Msk      (0x3e000000UL)            /*!< GAINLNAATTEN (Bitfield-Mask: 0x1f)                    */
/* ========================================================  STATUS1  ======================================================== */
#define AGC_STATUS1_CHPWR_Pos             (0UL)                     /*!< CHPWR (Bit 0)                                         */
#define AGC_STATUS1_CHPWR_Msk             (0xffUL)                  /*!< CHPWR (Bitfield-Mask: 0xff)                           */
#define AGC_STATUS1_ADCSTABILITYDET_Pos   (9UL)                     /*!< ADCSTABILITYDET (Bit 9)                               */
#define AGC_STATUS1_ADCSTABILITYDET_Msk   (0x200UL)                 /*!< ADCSTABILITYDET (Bitfield-Mask: 0x01)                 */
#define AGC_STATUS1_PGAPEAKDET2_Pos       (10UL)                    /*!< PGAPEAKDET2 (Bit 10)                                  */
#define AGC_STATUS1_PGAPEAKDET2_Msk       (0x400UL)                 /*!< PGAPEAKDET2 (Bitfield-Mask: 0x01)                     */
#define AGC_STATUS1_PGAPEAKDET1_Pos       (11UL)                    /*!< PGAPEAKDET1 (Bit 11)                                  */
#define AGC_STATUS1_PGAPEAKDET1_Msk       (0x800UL)                 /*!< PGAPEAKDET1 (Bitfield-Mask: 0x01)                     */
#define AGC_STATUS1_CFLOOPSTATE_Pos       (12UL)                    /*!< CFLOOPSTATE (Bit 12)                                  */
#define AGC_STATUS1_CFLOOPSTATE_Msk       (0x3000UL)                /*!< CFLOOPSTATE (Bitfield-Mask: 0x03)                     */
#define AGC_STATUS1_FASTLOOPSTATE_Pos     (14UL)                    /*!< FASTLOOPSTATE (Bit 14)                                */
#define AGC_STATUS1_FASTLOOPSTATE_Msk     (0x1c000UL)               /*!< FASTLOOPSTATE (Bitfield-Mask: 0x07)                   */
/* =========================================================  RSSI  ========================================================== */
#define AGC_RSSI_RSSIFRAC_Pos             (6UL)                     /*!< RSSIFRAC (Bit 6)                                      */
#define AGC_RSSI_RSSIFRAC_Msk             (0xc0UL)                  /*!< RSSIFRAC (Bitfield-Mask: 0x03)                        */
#define AGC_RSSI_RSSIINT_Pos              (8UL)                     /*!< RSSIINT (Bit 8)                                       */
#define AGC_RSSI_RSSIINT_Msk              (0xff00UL)                /*!< RSSIINT (Bitfield-Mask: 0xff)                         */
/* =======================================================  FRAMERSSI  ======================================================= */
#define AGC_FRAMERSSI_FRAMERSSIFRAC_Pos   (6UL)                     /*!< FRAMERSSIFRAC (Bit 6)                                 */
#define AGC_FRAMERSSI_FRAMERSSIFRAC_Msk   (0xc0UL)                  /*!< FRAMERSSIFRAC (Bitfield-Mask: 0x03)                   */
#define AGC_FRAMERSSI_FRAMERSSIINT_Pos    (8UL)                     /*!< FRAMERSSIINT (Bit 8)                                  */
#define AGC_FRAMERSSI_FRAMERSSIINT_Msk    (0xff00UL)                /*!< FRAMERSSIINT (Bitfield-Mask: 0xff)                    */
/* =========================================================  CTRL0  ========================================================= */
#define AGC_CTRL0_PWRTARGET_Pos           (0UL)                     /*!< PWRTARGET (Bit 0)                                     */
#define AGC_CTRL0_PWRTARGET_Msk           (0xffUL)                  /*!< PWRTARGET (Bitfield-Mask: 0xff)                       */
#define AGC_CTRL0_MODE_Pos                (8UL)                     /*!< MODE (Bit 8)                                          */
#define AGC_CTRL0_MODE_Msk                (0x700UL)                 /*!< MODE (Bitfield-Mask: 0x07)                            */
#define AGC_CTRL0_RSSISHIFT_Pos           (11UL)                    /*!< RSSISHIFT (Bit 11)                                    */
#define AGC_CTRL0_RSSISHIFT_Msk           (0x7f800UL)               /*!< RSSISHIFT (Bitfield-Mask: 0xff)                       */
#define AGC_CTRL0_DISCFLOOPADJ_Pos        (19UL)                    /*!< DISCFLOOPADJ (Bit 19)                                 */
#define AGC_CTRL0_DISCFLOOPADJ_Msk        (0x80000UL)               /*!< DISCFLOOPADJ (Bitfield-Mask: 0x01)                    */
#define AGC_CTRL0_USEADCSATDET_Pos        (20UL)                    /*!< USEADCSATDET (Bit 20)                                 */
#define AGC_CTRL0_USEADCSATDET_Msk        (0x100000UL)              /*!< USEADCSATDET (Bitfield-Mask: 0x01)                    */
#define AGC_CTRL0_AGCCLKUNDIVREQ_Pos      (21UL)                    /*!< AGCCLKUNDIVREQ (Bit 21)                               */
#define AGC_CTRL0_AGCCLKUNDIVREQ_Msk      (0x200000UL)              /*!< AGCCLKUNDIVREQ (Bitfield-Mask: 0x01)                  */
#define AGC_CTRL0_DISRESETCHPWR_Pos       (22UL)                    /*!< DISRESETCHPWR (Bit 22)                                */
#define AGC_CTRL0_DISRESETCHPWR_Msk       (0x400000UL)              /*!< DISRESETCHPWR (Bitfield-Mask: 0x01)                   */
#define AGC_CTRL0_ADCRESETDURATION_Pos    (23UL)                    /*!< ADCRESETDURATION (Bit 23)                             */
#define AGC_CTRL0_ADCRESETDURATION_Msk    (0x1800000UL)             /*!< ADCRESETDURATION (Bitfield-Mask: 0x03)                */
/* =========================================================  CTRL1  ========================================================= */
#define AGC_CTRL1_CCATHRSH_Pos            (0UL)                     /*!< CCATHRSH (Bit 0)                                      */
#define AGC_CTRL1_CCATHRSH_Msk            (0xffUL)                  /*!< CCATHRSH (Bitfield-Mask: 0xff)                        */
#define AGC_CTRL1_RSSIPERIOD_Pos          (8UL)                     /*!< RSSIPERIOD (Bit 8)                                    */
#define AGC_CTRL1_RSSIPERIOD_Msk          (0xf00UL)                 /*!< RSSIPERIOD (Bitfield-Mask: 0x0f)                      */
#define AGC_CTRL1_AGCPERIOD_Pos           (12UL)                    /*!< AGCPERIOD (Bit 12)                                    */
#define AGC_CTRL1_AGCPERIOD_Msk           (0x7000UL)                /*!< AGCPERIOD (Bitfield-Mask: 0x07)                       */
#define AGC_CTRL1_SUBPERIOD_Pos           (15UL)                    /*!< SUBPERIOD (Bit 15)                                    */
#define AGC_CTRL1_SUBPERIOD_Msk           (0x8000UL)                /*!< SUBPERIOD (Bitfield-Mask: 0x01)                       */
#define AGC_CTRL1_SUBNUM_Pos              (16UL)                    /*!< SUBNUM (Bit 16)                                       */
#define AGC_CTRL1_SUBNUM_Msk              (0x1f0000UL)              /*!< SUBNUM (Bitfield-Mask: 0x1f)                          */
#define AGC_CTRL1_SUBDEN_Pos              (21UL)                    /*!< SUBDEN (Bit 21)                                       */
#define AGC_CTRL1_SUBDEN_Msk              (0x3e00000UL)             /*!< SUBDEN (Bitfield-Mask: 0x1f)                          */
#define AGC_CTRL1_SUBINT_Pos              (26UL)                    /*!< SUBINT (Bit 26)                                       */
#define AGC_CTRL1_SUBINT_Msk              (0xfc000000UL)            /*!< SUBINT (Bitfield-Mask: 0x3f)                          */
/* =========================================================  CTRL2  ========================================================= */
#define AGC_CTRL2_FASTSTEP_Pos            (0UL)                     /*!< FASTSTEP (Bit 0)                                      */
#define AGC_CTRL2_FASTSTEP_Msk            (0x1fUL)                  /*!< FASTSTEP (Bitfield-Mask: 0x1f)                        */
#define AGC_CTRL2_HYST_Pos                (5UL)                     /*!< HYST (Bit 5)                                          */
#define AGC_CTRL2_HYST_Msk                (0x1e0UL)                 /*!< HYST (Bitfield-Mask: 0x0f)                            */
#define AGC_CTRL2_DMASEL_Pos              (9UL)                     /*!< DMASEL (Bit 9)                                        */
#define AGC_CTRL2_DMASEL_Msk              (0x200UL)                 /*!< DMASEL (Bitfield-Mask: 0x01)                          */
#define AGC_CTRL2_MAXPWRVAR_Pos           (10UL)                    /*!< MAXPWRVAR (Bit 10)                                    */
#define AGC_CTRL2_MAXPWRVAR_Msk           (0xfc00UL)                /*!< MAXPWRVAR (Bitfield-Mask: 0x3f)                       */
#define AGC_CTRL2_FASTLOOPDEL_Pos         (16UL)                    /*!< FASTLOOPDEL (Bit 16)                                  */
#define AGC_CTRL2_FASTLOOPDEL_Msk         (0xf0000UL)               /*!< FASTLOOPDEL (Bitfield-Mask: 0x0f)                     */
#define AGC_CTRL2_CFLOOPDEL_Pos           (20UL)                    /*!< CFLOOPDEL (Bit 20)                                    */
#define AGC_CTRL2_CFLOOPDEL_Msk           (0x3f00000UL)             /*!< CFLOOPDEL (Bitfield-Mask: 0x3f)                       */
#define AGC_CTRL2_RSSIFAST_Pos            (26UL)                    /*!< RSSIFAST (Bit 26)                                     */
#define AGC_CTRL2_RSSIFAST_Msk            (0x4000000UL)             /*!< RSSIFAST (Bitfield-Mask: 0x01)                        */
#define AGC_CTRL2_SLOWGAINADJ_Pos         (27UL)                    /*!< SLOWGAINADJ (Bit 27)                                  */
#define AGC_CTRL2_SLOWGAINADJ_Msk         (0x8000000UL)             /*!< SLOWGAINADJ (Bitfield-Mask: 0x01)                     */
#define AGC_CTRL2_ADCRSTFASTLOOP_Pos      (29UL)                    /*!< ADCRSTFASTLOOP (Bit 29)                               */
#define AGC_CTRL2_ADCRSTFASTLOOP_Msk      (0x60000000UL)            /*!< ADCRSTFASTLOOP (Bitfield-Mask: 0x03)                  */
#define AGC_CTRL2_ADCRSTSTARTUP_Pos       (31UL)                    /*!< ADCRSTSTARTUP (Bit 31)                                */
#define AGC_CTRL2_ADCRSTSTARTUP_Msk       (0x80000000UL)            /*!< ADCRSTSTARTUP (Bitfield-Mask: 0x01)                   */
/* ======================================================  RSSISTEPTHR  ====================================================== */
#define AGC_RSSISTEPTHR_POSSTEPTHR_Pos    (0UL)                     /*!< POSSTEPTHR (Bit 0)                                    */
#define AGC_RSSISTEPTHR_POSSTEPTHR_Msk    (0xffUL)                  /*!< POSSTEPTHR (Bitfield-Mask: 0xff)                      */
#define AGC_RSSISTEPTHR_NEGSTEPTHR_Pos    (8UL)                     /*!< NEGSTEPTHR (Bit 8)                                    */
#define AGC_RSSISTEPTHR_NEGSTEPTHR_Msk    (0xff00UL)                /*!< NEGSTEPTHR (Bitfield-Mask: 0xff)                      */
/* =======================================================  IFPEAKDET  ======================================================= */
#define AGC_IFPEAKDET_PKDTHRESH1_Pos      (0UL)                     /*!< PKDTHRESH1 (Bit 0)                                    */
#define AGC_IFPEAKDET_PKDTHRESH1_Msk      (0xfUL)                   /*!< PKDTHRESH1 (Bitfield-Mask: 0x0f)                      */
#define AGC_IFPEAKDET_PKDTHRESH2_Pos      (4UL)                     /*!< PKDTHRESH2 (Bit 4)                                    */
#define AGC_IFPEAKDET_PKDTHRESH2_Msk      (0xf0UL)                  /*!< PKDTHRESH2 (Bitfield-Mask: 0x0f)                      */
#define AGC_IFPEAKDET_MODEPKD_Pos         (8UL)                     /*!< MODEPKD (Bit 8)                                       */
#define AGC_IFPEAKDET_MODEPKD_Msk         (0x300UL)                 /*!< MODEPKD (Bitfield-Mask: 0x03)                         */
/* ========================================================  MANGAIN  ======================================================== */
#define AGC_MANGAIN_MANGAININDEX_Pos      (0UL)                     /*!< MANGAININDEX (Bit 0)                                  */
#define AGC_MANGAIN_MANGAININDEX_Msk      (0x3fUL)                  /*!< MANGAININDEX (Bitfield-Mask: 0x3f)                    */
#define AGC_MANGAIN_MANGAININDEXEN_Pos    (7UL)                     /*!< MANGAININDEXEN (Bit 7)                                */
#define AGC_MANGAIN_MANGAININDEXEN_Msk    (0x80UL)                  /*!< MANGAININDEXEN (Bitfield-Mask: 0x01)                  */
#define AGC_MANGAIN_MANGAINIFPGA_Pos      (9UL)                     /*!< MANGAINIFPGA (Bit 9)                                  */
#define AGC_MANGAIN_MANGAINIFPGA_Msk      (0x1e00UL)                /*!< MANGAINIFPGA (Bitfield-Mask: 0x0f)                    */
#define AGC_MANGAIN_MANGAINLNADEGEN_Pos   (13UL)                    /*!< MANGAINLNADEGEN (Bit 13)                              */
#define AGC_MANGAIN_MANGAINLNADEGEN_Msk   (0xe000UL)                /*!< MANGAINLNADEGEN (Bitfield-Mask: 0x07)                 */
#define AGC_MANGAIN_MANGAINLNASLICES_Pos  (16UL)                    /*!< MANGAINLNASLICES (Bit 16)                             */
#define AGC_MANGAIN_MANGAINLNASLICES_Msk  (0xf0000UL)               /*!< MANGAINLNASLICES (Bitfield-Mask: 0x0f)                */
#define AGC_MANGAIN_MANGAINLNAATTEN_Pos   (21UL)                    /*!< MANGAINLNAATTEN (Bit 21)                              */
#define AGC_MANGAIN_MANGAINLNAATTEN_Msk   (0x3e00000UL)             /*!< MANGAINLNAATTEN (Bitfield-Mask: 0x1f)                 */
#define AGC_MANGAIN_MANGAINLNASLICESREG_Pos (26UL)                  /*!< MANGAINLNASLICESREG (Bit 26)                          */
#define AGC_MANGAIN_MANGAINLNASLICESREG_Msk (0x3c000000UL)          /*!< MANGAINLNASLICESREG (Bitfield-Mask: 0x0f)             */
#define AGC_MANGAIN_MANGAINEN_Pos         (30UL)                    /*!< MANGAINEN (Bit 30)                                    */
#define AGC_MANGAIN_MANGAINEN_Msk         (0x40000000UL)            /*!< MANGAINEN (Bitfield-Mask: 0x01)                       */
/* ==========================================================  IF  =========================================================== */
#define AGC_IF_RSSIVALID_Pos              (0UL)                     /*!< RSSIVALID (Bit 0)                                     */
#define AGC_IF_RSSIVALID_Msk              (0x1UL)                   /*!< RSSIVALID (Bitfield-Mask: 0x01)                       */
#define AGC_IF_CCA_Pos                    (2UL)                     /*!< CCA (Bit 2)                                           */
#define AGC_IF_CCA_Msk                    (0x4UL)                   /*!< CCA (Bitfield-Mask: 0x01)                             */
#define AGC_IF_RSSIPOSSTEP_Pos            (3UL)                     /*!< RSSIPOSSTEP (Bit 3)                                   */
#define AGC_IF_RSSIPOSSTEP_Msk            (0x8UL)                   /*!< RSSIPOSSTEP (Bitfield-Mask: 0x01)                     */
#define AGC_IF_RSSINEGSTEP_Pos            (4UL)                     /*!< RSSINEGSTEP (Bit 4)                                   */
#define AGC_IF_RSSINEGSTEP_Msk            (0x10UL)                  /*!< RSSINEGSTEP (Bitfield-Mask: 0x01)                     */
#define AGC_IF_RSSIDONE_Pos               (5UL)                     /*!< RSSIDONE (Bit 5)                                      */
#define AGC_IF_RSSIDONE_Msk               (0x20UL)                  /*!< RSSIDONE (Bitfield-Mask: 0x01)                        */
/* ==========================================================  IFS  ========================================================== */
#define AGC_IFS_RSSIVALID_Pos             (0UL)                     /*!< RSSIVALID (Bit 0)                                     */
#define AGC_IFS_RSSIVALID_Msk             (0x1UL)                   /*!< RSSIVALID (Bitfield-Mask: 0x01)                       */
#define AGC_IFS_CCA_Pos                   (2UL)                     /*!< CCA (Bit 2)                                           */
#define AGC_IFS_CCA_Msk                   (0x4UL)                   /*!< CCA (Bitfield-Mask: 0x01)                             */
#define AGC_IFS_RSSIPOSSTEP_Pos           (3UL)                     /*!< RSSIPOSSTEP (Bit 3)                                   */
#define AGC_IFS_RSSIPOSSTEP_Msk           (0x8UL)                   /*!< RSSIPOSSTEP (Bitfield-Mask: 0x01)                     */
#define AGC_IFS_RSSINEGSTEP_Pos           (4UL)                     /*!< RSSINEGSTEP (Bit 4)                                   */
#define AGC_IFS_RSSINEGSTEP_Msk           (0x10UL)                  /*!< RSSINEGSTEP (Bitfield-Mask: 0x01)                     */
#define AGC_IFS_RSSIDONE_Pos              (5UL)                     /*!< RSSIDONE (Bit 5)                                      */
#define AGC_IFS_RSSIDONE_Msk              (0x20UL)                  /*!< RSSIDONE (Bitfield-Mask: 0x01)                        */
/* ==========================================================  IFC  ========================================================== */
#define AGC_IFC_RSSIVALID_Pos             (0UL)                     /*!< RSSIVALID (Bit 0)                                     */
#define AGC_IFC_RSSIVALID_Msk             (0x1UL)                   /*!< RSSIVALID (Bitfield-Mask: 0x01)                       */
#define AGC_IFC_CCA_Pos                   (2UL)                     /*!< CCA (Bit 2)                                           */
#define AGC_IFC_CCA_Msk                   (0x4UL)                   /*!< CCA (Bitfield-Mask: 0x01)                             */
#define AGC_IFC_RSSIPOSSTEP_Pos           (3UL)                     /*!< RSSIPOSSTEP (Bit 3)                                   */
#define AGC_IFC_RSSIPOSSTEP_Msk           (0x8UL)                   /*!< RSSIPOSSTEP (Bitfield-Mask: 0x01)                     */
#define AGC_IFC_RSSINEGSTEP_Pos           (4UL)                     /*!< RSSINEGSTEP (Bit 4)                                   */
#define AGC_IFC_RSSINEGSTEP_Msk           (0x10UL)                  /*!< RSSINEGSTEP (Bitfield-Mask: 0x01)                     */
#define AGC_IFC_RSSIDONE_Pos              (5UL)                     /*!< RSSIDONE (Bit 5)                                      */
#define AGC_IFC_RSSIDONE_Msk              (0x20UL)                  /*!< RSSIDONE (Bitfield-Mask: 0x01)                        */
/* ==========================================================  IEN  ========================================================== */
#define AGC_IEN_RSSIVALID_Pos             (0UL)                     /*!< RSSIVALID (Bit 0)                                     */
#define AGC_IEN_RSSIVALID_Msk             (0x1UL)                   /*!< RSSIVALID (Bitfield-Mask: 0x01)                       */
#define AGC_IEN_CCA_Pos                   (2UL)                     /*!< CCA (Bit 2)                                           */
#define AGC_IEN_CCA_Msk                   (0x4UL)                   /*!< CCA (Bitfield-Mask: 0x01)                             */
#define AGC_IEN_RSSIPOSSTEP_Pos           (3UL)                     /*!< RSSIPOSSTEP (Bit 3)                                   */
#define AGC_IEN_RSSIPOSSTEP_Msk           (0x8UL)                   /*!< RSSIPOSSTEP (Bitfield-Mask: 0x01)                     */
#define AGC_IEN_RSSINEGSTEP_Pos           (4UL)                     /*!< RSSINEGSTEP (Bit 4)                                   */
#define AGC_IEN_RSSINEGSTEP_Msk           (0x10UL)                  /*!< RSSINEGSTEP (Bitfield-Mask: 0x01)                     */
#define AGC_IEN_RSSIDONE_Pos              (5UL)                     /*!< RSSIDONE (Bit 5)                                      */
#define AGC_IEN_RSSIDONE_Msk              (0x20UL)                  /*!< RSSIDONE (Bitfield-Mask: 0x01)                        */
/* ==========================================================  CMD  ========================================================== */
#define AGC_CMD_RSSISTART_Pos             (0UL)                     /*!< RSSISTART (Bit 0)                                     */
#define AGC_CMD_RSSISTART_Msk             (0x1UL)                   /*!< RSSISTART (Bitfield-Mask: 0x01)                       */
/* =======================================================  GAINRANGE  ======================================================= */
#define AGC_GAINRANGE_MAXGAIN_Pos         (0UL)                     /*!< MAXGAIN (Bit 0)                                       */
#define AGC_GAINRANGE_MAXGAIN_Msk         (0x7fUL)                  /*!< MAXGAIN (Bitfield-Mask: 0x7f)                         */
#define AGC_GAINRANGE_MINGAIN_Pos         (7UL)                     /*!< MINGAIN (Bit 7)                                       */
#define AGC_GAINRANGE_MINGAIN_Msk         (0x3f80UL)                /*!< MINGAIN (Bitfield-Mask: 0x7f)                         */
/* =======================================================  GAININDEX  ======================================================= */
#define AGC_GAININDEX_NUMINDEXPGA_Pos     (0UL)                     /*!< NUMINDEXPGA (Bit 0)                                   */
#define AGC_GAININDEX_NUMINDEXPGA_Msk     (0xfUL)                   /*!< NUMINDEXPGA (Bitfield-Mask: 0x0f)                     */
#define AGC_GAININDEX_NUMINDEXDEGEN_Pos   (4UL)                     /*!< NUMINDEXDEGEN (Bit 4)                                 */
#define AGC_GAININDEX_NUMINDEXDEGEN_Msk   (0x30UL)                  /*!< NUMINDEXDEGEN (Bitfield-Mask: 0x03)                   */
#define AGC_GAININDEX_NUMINDEXSLICES_Pos  (6UL)                     /*!< NUMINDEXSLICES (Bit 6)                                */
#define AGC_GAININDEX_NUMINDEXSLICES_Msk  (0x1c0UL)                 /*!< NUMINDEXSLICES (Bitfield-Mask: 0x07)                  */
#define AGC_GAININDEX_NUMINDEXATTEN_Pos   (9UL)                     /*!< NUMINDEXATTEN (Bit 9)                                 */
#define AGC_GAININDEX_NUMINDEXATTEN_Msk   (0x3e00UL)                /*!< NUMINDEXATTEN (Bitfield-Mask: 0x1f)                   */
#define AGC_GAININDEX_MININDEXPGA_Pos     (14UL)                    /*!< MININDEXPGA (Bit 14)                                  */
#define AGC_GAININDEX_MININDEXPGA_Msk     (0x3c000UL)               /*!< MININDEXPGA (Bitfield-Mask: 0x0f)                     */
#define AGC_GAININDEX_MININDEXDEGEN_Pos   (18UL)                    /*!< MININDEXDEGEN (Bit 18)                                */
