VDowbensky/efr32_baremetal/baremetal_test/chip/efr32fg1v_agc.h
#define AGC_GAININDEX_MININDEXDEGEN_Msk   (0xc0000UL)               /*!< MININDEXDEGEN (Bitfield-Mask: 0x03)                   */
/* =======================================================  SLICECODE  ======================================================= */
#define AGC_SLICECODE_SLICECODEINDEX0_Pos (0UL)                     /*!< SLICECODEINDEX0 (Bit 0)                               */
#define AGC_SLICECODE_SLICECODEINDEX0_Msk (0xfUL)                   /*!< SLICECODEINDEX0 (Bitfield-Mask: 0x0f)                 */
#define AGC_SLICECODE_SLICECODEINDEX1_Pos (4UL)                     /*!< SLICECODEINDEX1 (Bit 4)                               */
#define AGC_SLICECODE_SLICECODEINDEX1_Msk (0xf0UL)                  /*!< SLICECODEINDEX1 (Bitfield-Mask: 0x0f)                 */
#define AGC_SLICECODE_SLICECODEINDEX2_Pos (8UL)                     /*!< SLICECODEINDEX2 (Bit 8)                               */
#define AGC_SLICECODE_SLICECODEINDEX2_Msk (0xf00UL)                 /*!< SLICECODEINDEX2 (Bitfield-Mask: 0x0f)                 */
#define AGC_SLICECODE_SLICECODEINDEX3_Pos (12UL)                    /*!< SLICECODEINDEX3 (Bit 12)                              */
#define AGC_SLICECODE_SLICECODEINDEX3_Msk (0xf000UL)                /*!< SLICECODEINDEX3 (Bitfield-Mask: 0x0f)                 */
#define AGC_SLICECODE_SLICECODEINDEX4_Pos (16UL)                    /*!< SLICECODEINDEX4 (Bit 16)                              */
#define AGC_SLICECODE_SLICECODEINDEX4_Msk (0xf0000UL)               /*!< SLICECODEINDEX4 (Bitfield-Mask: 0x0f)                 */
#define AGC_SLICECODE_SLICECODEINDEX5_Pos (20UL)                    /*!< SLICECODEINDEX5 (Bit 20)                              */
#define AGC_SLICECODE_SLICECODEINDEX5_Msk (0xf00000UL)              /*!< SLICECODEINDEX5 (Bitfield-Mask: 0x0f)                 */
#define AGC_SLICECODE_SLICECODEINDEX6_Pos (24UL)                    /*!< SLICECODEINDEX6 (Bit 24)                              */
#define AGC_SLICECODE_SLICECODEINDEX6_Msk (0xf000000UL)             /*!< SLICECODEINDEX6 (Bitfield-Mask: 0x0f)                 */
/* ======================================================  ATTENCODE1  ======================================================= */
#define AGC_ATTENCODE1_ATTENCODEINDEX0_Pos (0UL)                    /*!< ATTENCODEINDEX0 (Bit 0)                               */
#define AGC_ATTENCODE1_ATTENCODEINDEX0_Msk (0xfUL)                  /*!< ATTENCODEINDEX0 (Bitfield-Mask: 0x0f)                 */
#define AGC_ATTENCODE1_ATTENCODEINDEX1_Pos (4UL)                    /*!< ATTENCODEINDEX1 (Bit 4)                               */
#define AGC_ATTENCODE1_ATTENCODEINDEX1_Msk (0xf0UL)                 /*!< ATTENCODEINDEX1 (Bitfield-Mask: 0x0f)                 */
#define AGC_ATTENCODE1_ATTENCODEINDEX2_Pos (8UL)                    /*!< ATTENCODEINDEX2 (Bit 8)                               */
#define AGC_ATTENCODE1_ATTENCODEINDEX2_Msk (0xf00UL)                /*!< ATTENCODEINDEX2 (Bitfield-Mask: 0x0f)                 */
#define AGC_ATTENCODE1_ATTENCODEINDEX3_Pos (12UL)                   /*!< ATTENCODEINDEX3 (Bit 12)                              */
#define AGC_ATTENCODE1_ATTENCODEINDEX3_Msk (0xf000UL)               /*!< ATTENCODEINDEX3 (Bitfield-Mask: 0x0f)                 */
#define AGC_ATTENCODE1_ATTENCODEINDEX4_Pos (16UL)                   /*!< ATTENCODEINDEX4 (Bit 16)                              */
#define AGC_ATTENCODE1_ATTENCODEINDEX4_Msk (0xf0000UL)              /*!< ATTENCODEINDEX4 (Bitfield-Mask: 0x0f)                 */
#define AGC_ATTENCODE1_ATTENCODEINDEX5_Pos (20UL)                   /*!< ATTENCODEINDEX5 (Bit 20)                              */
#define AGC_ATTENCODE1_ATTENCODEINDEX5_Msk (0xf00000UL)             /*!< ATTENCODEINDEX5 (Bitfield-Mask: 0x0f)                 */
#define AGC_ATTENCODE1_ATTENCODEINDEX6_Pos (24UL)                   /*!< ATTENCODEINDEX6 (Bit 24)                              */
#define AGC_ATTENCODE1_ATTENCODEINDEX6_Msk (0xf000000UL)            /*!< ATTENCODEINDEX6 (Bitfield-Mask: 0x0f)                 */
/* ======================================================  ATTENCODE2  ======================================================= */
#define AGC_ATTENCODE2_ATTENCODEINDEX7_Pos (0UL)                    /*!< ATTENCODEINDEX7 (Bit 0)                               */
#define AGC_ATTENCODE2_ATTENCODEINDEX7_Msk (0x1fUL)                 /*!< ATTENCODEINDEX7 (Bitfield-Mask: 0x1f)                 */
#define AGC_ATTENCODE2_ATTENCODEINDEX8_Pos (5UL)                    /*!< ATTENCODEINDEX8 (Bit 5)                               */
#define AGC_ATTENCODE2_ATTENCODEINDEX8_Msk (0x3e0UL)                /*!< ATTENCODEINDEX8 (Bitfield-Mask: 0x1f)                 */
#define AGC_ATTENCODE2_ATTENCODEINDEX9_Pos (10UL)                   /*!< ATTENCODEINDEX9 (Bit 10)                              */
#define AGC_ATTENCODE2_ATTENCODEINDEX9_Msk (0x7c00UL)               /*!< ATTENCODEINDEX9 (Bitfield-Mask: 0x1f)                 */
#define AGC_ATTENCODE2_ATTENCODEINDEX10_Pos (15UL)                  /*!< ATTENCODEINDEX10 (Bit 15)                             */
#define AGC_ATTENCODE2_ATTENCODEINDEX10_Msk (0xf8000UL)             /*!< ATTENCODEINDEX10 (Bitfield-Mask: 0x1f)                */
#define AGC_ATTENCODE2_ATTENCODEINDEX11_Pos (20UL)                  /*!< ATTENCODEINDEX11 (Bit 20)                             */
#define AGC_ATTENCODE2_ATTENCODEINDEX11_Msk (0x1f00000UL)           /*!< ATTENCODEINDEX11 (Bitfield-Mask: 0x1f)                */
#define AGC_ATTENCODE2_ATTENCODEINDEX12_Pos (25UL)                  /*!< ATTENCODEINDEX12 (Bit 25)                             */
#define AGC_ATTENCODE2_ATTENCODEINDEX12_Msk (0x3e000000UL)          /*!< ATTENCODEINDEX12 (Bitfield-Mask: 0x1f)                */
/* ======================================================  ATTENCODE3  ======================================================= */
#define AGC_ATTENCODE3_ATTENCODEINDEX13_Pos (0UL)                   /*!< ATTENCODEINDEX13 (Bit 0)                              */
#define AGC_ATTENCODE3_ATTENCODEINDEX13_Msk (0x1fUL)                /*!< ATTENCODEINDEX13 (Bitfield-Mask: 0x1f)                */
#define AGC_ATTENCODE3_ATTENCODEINDEX14_Pos (5UL)                   /*!< ATTENCODEINDEX14 (Bit 5)                              */
#define AGC_ATTENCODE3_ATTENCODEINDEX14_Msk (0x3e0UL)               /*!< ATTENCODEINDEX14 (Bitfield-Mask: 0x1f)                */
#define AGC_ATTENCODE3_ATTENCODEINDEX15_Pos (10UL)                  /*!< ATTENCODEINDEX15 (Bit 10)                             */
#define AGC_ATTENCODE3_ATTENCODEINDEX15_Msk (0x7c00UL)              /*!< ATTENCODEINDEX15 (Bitfield-Mask: 0x1f)                */
#define AGC_ATTENCODE3_ATTENCODEINDEX16_Pos (15UL)                  /*!< ATTENCODEINDEX16 (Bit 15)                             */
#define AGC_ATTENCODE3_ATTENCODEINDEX16_Msk (0xf8000UL)             /*!< ATTENCODEINDEX16 (Bitfield-Mask: 0x1f)                */
#define AGC_ATTENCODE3_ATTENCODEINDEX17_Pos (20UL)                  /*!< ATTENCODEINDEX17 (Bit 20)                             */
#define AGC_ATTENCODE3_ATTENCODEINDEX17_Msk (0x1f00000UL)           /*!< ATTENCODEINDEX17 (Bitfield-Mask: 0x1f)                */
#define AGC_ATTENCODE3_ATTENCODEINDEX18_Pos (25UL)                  /*!< ATTENCODEINDEX18 (Bit 25)                             */
#define AGC_ATTENCODE3_ATTENCODEINDEX18_Msk (0x3e000000UL)          /*!< ATTENCODEINDEX18 (Bitfield-Mask: 0x1f)                */
/* ======================================================  GAINERROR1  ======================================================= */
#define AGC_GAINERROR1_DEGENERRINDEX0_Pos (0UL)                     /*!< DEGENERRINDEX0 (Bit 0)                                */
#define AGC_GAINERROR1_DEGENERRINDEX0_Msk (0x7UL)                   /*!< DEGENERRINDEX0 (Bitfield-Mask: 0x07)                  */
#define AGC_GAINERROR1_DEGENERRINDEX1_Pos (3UL)                     /*!< DEGENERRINDEX1 (Bit 3)                                */
#define AGC_GAINERROR1_DEGENERRINDEX1_Msk (0x38UL)                  /*!< DEGENERRINDEX1 (Bitfield-Mask: 0x07)                  */
#define AGC_GAINERROR1_DEGENERRINDEX2_Pos (6UL)                     /*!< DEGENERRINDEX2 (Bit 6)                                */
#define AGC_GAINERROR1_DEGENERRINDEX2_Msk (0x1c0UL)                 /*!< DEGENERRINDEX2 (Bitfield-Mask: 0x07)                  */
#define AGC_GAINERROR1_SLICEERRINDEX0_Pos (9UL)                     /*!< SLICEERRINDEX0 (Bit 9)                                */
#define AGC_GAINERROR1_SLICEERRINDEX0_Msk (0xe00UL)                 /*!< SLICEERRINDEX0 (Bitfield-Mask: 0x07)                  */
#define AGC_GAINERROR1_SLICEERRINDEX1_Pos (12UL)                    /*!< SLICEERRINDEX1 (Bit 12)                               */
#define AGC_GAINERROR1_SLICEERRINDEX1_Msk (0x7000UL)                /*!< SLICEERRINDEX1 (Bitfield-Mask: 0x07)                  */
#define AGC_GAINERROR1_SLICEERRINDEX2_Pos (15UL)                    /*!< SLICEERRINDEX2 (Bit 15)                               */
#define AGC_GAINERROR1_SLICEERRINDEX2_Msk (0x38000UL)               /*!< SLICEERRINDEX2 (Bitfield-Mask: 0x07)                  */
#define AGC_GAINERROR1_SLICEERRINDEX3_Pos (18UL)                    /*!< SLICEERRINDEX3 (Bit 18)                               */
#define AGC_GAINERROR1_SLICEERRINDEX3_Msk (0x1c0000UL)              /*!< SLICEERRINDEX3 (Bitfield-Mask: 0x07)                  */
#define AGC_GAINERROR1_SLICEERRINDEX4_Pos (21UL)                    /*!< SLICEERRINDEX4 (Bit 21)                               */
#define AGC_GAINERROR1_SLICEERRINDEX4_Msk (0xe00000UL)              /*!< SLICEERRINDEX4 (Bitfield-Mask: 0x07)                  */
#define AGC_GAINERROR1_SLICEERRINDEX5_Pos (24UL)                    /*!< SLICEERRINDEX5 (Bit 24)                               */
#define AGC_GAINERROR1_SLICEERRINDEX5_Msk (0x7000000UL)             /*!< SLICEERRINDEX5 (Bitfield-Mask: 0x07)                  */
/* ======================================================  GAINERROR2  ======================================================= */
#define AGC_GAINERROR2_ATTENERRINDEX0_Pos (0UL)                     /*!< ATTENERRINDEX0 (Bit 0)                                */
#define AGC_GAINERROR2_ATTENERRINDEX0_Msk (0x7UL)                   /*!< ATTENERRINDEX0 (Bitfield-Mask: 0x07)                  */
#define AGC_GAINERROR2_ATTENERRINDEX1_Pos (3UL)                     /*!< ATTENERRINDEX1 (Bit 3)                                */
#define AGC_GAINERROR2_ATTENERRINDEX1_Msk (0x38UL)                  /*!< ATTENERRINDEX1 (Bitfield-Mask: 0x07)                  */
#define AGC_GAINERROR2_ATTENERRINDEX2_Pos (6UL)                     /*!< ATTENERRINDEX2 (Bit 6)                                */
#define AGC_GAINERROR2_ATTENERRINDEX2_Msk (0x1c0UL)                 /*!< ATTENERRINDEX2 (Bitfield-Mask: 0x07)                  */
#define AGC_GAINERROR2_ATTENERRINDEX3_Pos (9UL)                     /*!< ATTENERRINDEX3 (Bit 9)                                */
#define AGC_GAINERROR2_ATTENERRINDEX3_Msk (0xe00UL)                 /*!< ATTENERRINDEX3 (Bitfield-Mask: 0x07)                  */
#define AGC_GAINERROR2_ATTENERRINDEX4_Pos (12UL)                    /*!< ATTENERRINDEX4 (Bit 12)                               */
#define AGC_GAINERROR2_ATTENERRINDEX4_Msk (0x7000UL)                /*!< ATTENERRINDEX4 (Bitfield-Mask: 0x07)                  */
#define AGC_GAINERROR2_ATTENERRINDEX5_Pos (15UL)                    /*!< ATTENERRINDEX5 (Bit 15)                               */
#define AGC_GAINERROR2_ATTENERRINDEX5_Msk (0x38000UL)               /*!< ATTENERRINDEX5 (Bitfield-Mask: 0x07)                  */
#define AGC_GAINERROR2_ATTENERRINDEX6_Pos (18UL)                    /*!< ATTENERRINDEX6 (Bit 18)                               */
#define AGC_GAINERROR2_ATTENERRINDEX6_Msk (0x1c0000UL)              /*!< ATTENERRINDEX6 (Bitfield-Mask: 0x07)                  */
#define AGC_GAINERROR2_ATTENERRINDEX7_Pos (21UL)                    /*!< ATTENERRINDEX7 (Bit 21)                               */
#define AGC_GAINERROR2_ATTENERRINDEX7_Msk (0xe00000UL)              /*!< ATTENERRINDEX7 (Bitfield-Mask: 0x07)                  */
#define AGC_GAINERROR2_ATTENERRINDEX8_Pos (24UL)                    /*!< ATTENERRINDEX8 (Bit 24)                               */
#define AGC_GAINERROR2_ATTENERRINDEX8_Msk (0x7000000UL)             /*!< ATTENERRINDEX8 (Bitfield-Mask: 0x07)                  */
#define AGC_GAINERROR2_ATTENERRINDEX9_Pos (27UL)                    /*!< ATTENERRINDEX9 (Bit 27)                               */
#define AGC_GAINERROR2_ATTENERRINDEX9_Msk (0x38000000UL)            /*!< ATTENERRINDEX9 (Bitfield-Mask: 0x07)                  */
/* ======================================================  GAINERROR3  ======================================================= */
#define AGC_GAINERROR3_ATTENERRINDEX10_Pos (0UL)                    /*!< ATTENERRINDEX10 (Bit 0)                               */
#define AGC_GAINERROR3_ATTENERRINDEX10_Msk (0x7UL)                  /*!< ATTENERRINDEX10 (Bitfield-Mask: 0x07)                 */
#define AGC_GAINERROR3_ATTENERRINDEX11_Pos (3UL)                    /*!< ATTENERRINDEX11 (Bit 3)                               */
#define AGC_GAINERROR3_ATTENERRINDEX11_Msk (0x38UL)                 /*!< ATTENERRINDEX11 (Bitfield-Mask: 0x07)                 */
#define AGC_GAINERROR3_ATTENERRINDEX12_Pos (6UL)                    /*!< ATTENERRINDEX12 (Bit 6)                               */
#define AGC_GAINERROR3_ATTENERRINDEX12_Msk (0x1c0UL)                /*!< ATTENERRINDEX12 (Bitfield-Mask: 0x07)                 */
#define AGC_GAINERROR3_ATTENERRINDEX13_Pos (9UL)                    /*!< ATTENERRINDEX13 (Bit 9)                               */
#define AGC_GAINERROR3_ATTENERRINDEX13_Msk (0xe00UL)                /*!< ATTENERRINDEX13 (Bitfield-Mask: 0x07)                 */
#define AGC_GAINERROR3_ATTENERRINDEX14_Pos (12UL)                   /*!< ATTENERRINDEX14 (Bit 12)                              */
#define AGC_GAINERROR3_ATTENERRINDEX14_Msk (0x7000UL)               /*!< ATTENERRINDEX14 (Bitfield-Mask: 0x07)                 */
#define AGC_GAINERROR3_ATTENERRINDEX15_Pos (15UL)                   /*!< ATTENERRINDEX15 (Bit 15)                              */
#define AGC_GAINERROR3_ATTENERRINDEX15_Msk (0x38000UL)              /*!< ATTENERRINDEX15 (Bitfield-Mask: 0x07)                 */
#define AGC_GAINERROR3_ATTENERRINDEX16_Pos (18UL)                   /*!< ATTENERRINDEX16 (Bit 18)                              */
#define AGC_GAINERROR3_ATTENERRINDEX16_Msk (0x1c0000UL)             /*!< ATTENERRINDEX16 (Bitfield-Mask: 0x07)                 */
#define AGC_GAINERROR3_ATTENERRINDEX17_Pos (21UL)                   /*!< ATTENERRINDEX17 (Bit 21)                              */
#define AGC_GAINERROR3_ATTENERRINDEX17_Msk (0xe00000UL)             /*!< ATTENERRINDEX17 (Bitfield-Mask: 0x07)                 */
/* ======================================================  MANUALCTRL  ======================================================= */
#define AGC_MANUALCTRL_ENMANUALRSTPKD_Pos (0UL)                     /*!< ENMANUALRSTPKD (Bit 0)                                */
#define AGC_MANUALCTRL_ENMANUALRSTPKD_Msk (0x1UL)                   /*!< ENMANUALRSTPKD (Bitfield-Mask: 0x01)                  */
#define AGC_MANUALCTRL_MANUALRSTPKD_Pos   (1UL)                     /*!< MANUALRSTPKD (Bit 1)                                  */
#define AGC_MANUALCTRL_MANUALRSTPKD_Msk   (0x2UL)                   /*!< MANUALRSTPKD (Bitfield-Mask: 0x01)                    */
#define AGC_MANUALCTRL_ENMANUALSLICESSEL_Pos (2UL)                  /*!< ENMANUALSLICESSEL (Bit 2)                             */
#define AGC_MANUALCTRL_ENMANUALSLICESSEL_Msk (0x4UL)                /*!< ENMANUALSLICESSEL (Bitfield-Mask: 0x01)               */
#define AGC_MANUALCTRL_MANUALSLICESSEL_Pos (3UL)                    /*!< MANUALSLICESSEL (Bit 3)                               */
#define AGC_MANUALCTRL_MANUALSLICESSEL_Msk (0x8UL)                  /*!< MANUALSLICESSEL (Bitfield-Mask: 0x01)                 */
#define AGC_MANUALCTRL_ENMANUALSLICESDUMP_Pos (4UL)                 /*!< ENMANUALSLICESDUMP (Bit 4)                            */
#define AGC_MANUALCTRL_ENMANUALSLICESDUMP_Msk (0x10UL)              /*!< ENMANUALSLICESDUMP (Bitfield-Mask: 0x01)              */
#define AGC_MANUALCTRL_MANUALSLICESDUMP_Pos (5UL)                   /*!< MANUALSLICESDUMP (Bit 5)                              */
#define AGC_MANUALCTRL_MANUALSLICESDUMP_Msk (0x20UL)                /*!< MANUALSLICESDUMP (Bitfield-Mask: 0x01)                */
/* ======================================================  GAINSTEPLIM  ====================================================== */
#define AGC_GAINSTEPLIM_FASTSTEPDOWN_Pos  (0UL)                     /*!< FASTSTEPDOWN (Bit 0)                                  */
#define AGC_GAINSTEPLIM_FASTSTEPDOWN_Msk  (0x3fUL)                  /*!< FASTSTEPDOWN (Bitfield-Mask: 0x3f)                    */
#define AGC_GAINSTEPLIM_EN2XFASTSTEPDOWN_Pos (6UL)                  /*!< EN2XFASTSTEPDOWN (Bit 6)                              */
#define AGC_GAINSTEPLIM_EN2XFASTSTEPDOWN_Msk (0x40UL)               /*!< EN2XFASTSTEPDOWN (Bitfield-Mask: 0x01)                */
#define AGC_GAINSTEPLIM_FASTSTEPUP_Pos    (7UL)                     /*!< FASTSTEPUP (Bit 7)                                    */
#define AGC_GAINSTEPLIM_FASTSTEPUP_Msk    (0x1f80UL)                /*!< FASTSTEPUP (Bitfield-Mask: 0x3f)                      */
#define AGC_GAINSTEPLIM_EN2XFASTSTEPUP_Pos (13UL)                   /*!< EN2XFASTSTEPUP (Bit 13)                               */
#define AGC_GAINSTEPLIM_EN2XFASTSTEPUP_Msk (0x2000UL)               /*!< EN2XFASTSTEPUP (Bitfield-Mask: 0x01)                  */
#define AGC_GAINSTEPLIM_CFLOOPSTEPMAX_Pos (14UL)                    /*!< CFLOOPSTEPMAX (Bit 14)                                */
#define AGC_GAINSTEPLIM_CFLOOPSTEPMAX_Msk (0xfc000UL)               /*!< CFLOOPSTEPMAX (Bitfield-Mask: 0x3f)                   */
/* ========================================================  LOOPDEL  ======================================================== */
#define AGC_LOOPDEL_PKDWAIT_Pos           (0UL)                     /*!< PKDWAIT (Bit 0)                                       */
#define AGC_LOOPDEL_PKDWAIT_Msk           (0xfUL)                   /*!< PKDWAIT (Bitfield-Mask: 0x0f)                         */
#define AGC_LOOPDEL_IFPGADEL_Pos          (4UL)                     /*!< IFPGADEL (Bit 4)                                      */
#define AGC_LOOPDEL_IFPGADEL_Msk          (0xf0UL)                  /*!< IFPGADEL (Bitfield-Mask: 0x0f)                        */
#define AGC_LOOPDEL_LNASLICESDEL_Pos      (8UL)                     /*!< LNASLICESDEL (Bit 8)                                  */
#define AGC_LOOPDEL_LNASLICESDEL_Msk      (0xf00UL)                 /*!< LNASLICESDEL (Bitfield-Mask: 0x0f)                    */
/* =======================================================  MININDEX  ======================================================== */
#define AGC_MININDEX_INDEXMINATTEN_Pos    (0UL)                     /*!< INDEXMINATTEN (Bit 0)                                 */
#define AGC_MININDEX_INDEXMINATTEN_Msk    (0x3fUL)                  /*!< INDEXMINATTEN (Bitfield-Mask: 0x3f)                   */
#define AGC_MININDEX_INDEXMINSLICES_Pos   (6UL)                     /*!< INDEXMINSLICES (Bit 6)                                */
#define AGC_MININDEX_INDEXMINSLICES_Msk   (0xfc0UL)                 /*!< INDEXMINSLICES (Bitfield-Mask: 0x3f)                  */
#define AGC_MININDEX_INDEXMINDEGEN_Pos    (12UL)                    /*!< INDEXMINDEGEN (Bit 12)                                */
#define AGC_MININDEX_INDEXMINDEGEN_Msk    (0x3f000UL)               /*!< INDEXMINDEGEN (Bitfield-Mask: 0x3f)                   */
#define AGC_MININDEX_INDEXMINPGA_Pos      (18UL)                    /*!< INDEXMINPGA (Bit 18)                                  */
#define AGC_MININDEX_INDEXMINPGA_Msk      (0xfc0000UL)              /*!< INDEXMINPGA (Bitfield-Mask: 0x3f)                     */



/** @} */
/** @} End of group EFR32FG1V_AGC */
/** @} End of group Parts */
